//输出什么？
#include <stdio.h>
int main()
{
	char a=-1;
	//原码 1000000000000000000000000000001
	//反码 1111111111111111111111111111110
	//补码 1111111111111111111111111111111
	//11111111 
	//因为打印的是%d,是整形，所以会发生整型提升 因为是char类型，是有符号数，所以最前面的是1，所以补全1
	//补全后为11111111111111111111111111111111（-1的补码） 所以还是-1(补码)
	//        11111111111111111111111111111110 （-1的反码）
	//        10000000000000000000000000000001 （-1的原码）所以是-1
	signed char b=-1;
	//11111111
	//b和a是一样的，因为是有符号数所以和a是一样的，打印出来是-1
	unsigned char c=-1;
	//11111111
	//因为c是无符号数，所以最高位的1不是符号位，所以补全0
	//补全为00000000000000000000000011111111 因为无符号数的原码反码补码都相同，所以直接打印出来为255
	printf("a=%d,b=%d,c=%d",a,b,c);//-1，-1，255
	return 0;
}*/
/*#include<stdio.h>
int main()
{
	char a=-128;
	char a1=128;
	char b=-1;
	char b1=255;
	char c=-127;
	char c1=129;
	//10000000000000000000000010000000 -128的二进制也就是原码
	//11111111111111111111111101111111 -128的反码
	//11111111111111111111111110000000 -128的补码
	//10000000 a发生截断,因为是char类型
	//11111111111111111111111110000000 发生整形提升，因为是char是有符号数，高位是1，所以补全1
	//因为是%u所以认为是无符号数，所以原码反码补码都是11111111111111111111111110000000 所以是4294967168
	printf("%u\n",a);//4294967168
	printf("%u\n",a1);//4294967168
	printf("%u\n",b);//4294967295
	printf("%u\n",b1);//4294967295
	printf("%u\n",c);//4294967169
	printf("%u\n",c1);//4294967169
	//%d -打印十进制的有符号数字于 
	//%u-打印十进制的无符号数字
	return 0;
}*/
//有符号的char的范围是-128--->127   10000000是-128
//无符号的char的范围是0------>255
//求下面的值
/*#include<stdio.h>
int main()
{
	int i=-20;
	//10000000000000000000000000010100 -20的原码
	//11111111111111111111111111101011 -20的反码
	//11111111111111111111111111101100 -20的补码
	unsigned int j=10;
	//00000000000000000000000000001010 10的原码反码补码
	//11111111111111111111111111110110 10和-20的补码相加得到的结果（补码）
	//11111111111111111111111111110101 10和-20的补码相加得到的结果（反码）
	//10000000000000000000000000001010 10和-20的补码相加得到的结果（原码）是-10
	printf("%d\n",i+j);//-10
	return 0;
}*/
/*#include<stdio.h>
#include<Windows.h>
int main()
{
	unsigned int i;
	for(i=9;i>=0;i--)
	{
		//printf("%u\n",i);//%u-打印十进制的无符号数字//死循环，因为i是无符号数，他一直是大于等于0 的，所以for循环的条件一直成立,无论最后打印的是%d,还是%u
		//9 8 7 6 5 4 3 2 1 0 4294967295 4294967294 4294967293 4294967292......
		printf("%d\n",i);
		//9 8 7 6 5 4 3 2 1 -1 -2 -3 -4 -5 -6......
		Sleep(100);//执行一次睡眠0.1秒
	}  
	return 0;
}*/
/*#include<stdio.h>
#include<string.h>
int main()
{
	char a[1000];
	int i;
	for(i=0;i<1000;i++)
	{
		a[i]=-1-i;//你可能认为是-1 -2 -3 .....-1000,因为没有'\0',所以输出一个随机数
		printf("%d\t",a[i]);
	}            //但是这道题a是char类型，它的范围是-128--->127，所以从-1 -2 -3...-128，他不能到-129，所以他会把-128--->127范围外的数据，转换成范围内的数据
	            //-1 -2 -3....-127 -128 127 126 125....3 2 1 0 -1 -2 -3 .....
	printf("%d",strlen(a));//255 strlen计算字符串长度的时候，遇到'\0'就停止，所以当循环到0的时候停止。strlen=127+128=255
	return 0;
}*/
/*#include<stdio.h>
unsigned char i=0;//unsigned char的范围是0---255  255+1变成0 在for循环里恒成立
int main()
{
	for(i=0;i<=255;i++)
	{
		printf("hello world\n");//死循环
	}
	return 0;
}*/